Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm Constructor (List<RebarItem>, String, String, Double, String)
 Creates a new instance of the ReinforcementSelectionForm and will select in the tree the rebar that contains the given parameters (if possible).
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementSelectionForm(
	List<RebarItem> RebarList,
	string Size,
	string Grade,
	double BendRadius,
	string Usage
)
Public Sub New (
	RebarList As List(Of RebarItem),
	Size As String,
	Grade As String,
	BendRadius As Double,
	Usage As String
)
Parameters
RebarList
Type: System.Collections.Generic.List<RebarItem>
A list with the rebars that will be added to the tree.
Size
Type: System.String
The size of the rebar to be selected.
Grade
Type: System.String
The grade of the rebar to be selected.
BendRadius
Type: System.Double
The bend radius of the rebar to be selected.
Usage
Type: System.String
The usage of the rebar to be selected.
See Also
Reference
ReinforcementSelectionForm Class
ReinforcementSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace